mikaelpatel/Cosa/boards.txt
##
# LILYPAD ARDUINO BOARDS
##

# AVR:ATmega328
# Ext Crystal Osc.>8 MHz; Start-up time PWRDWN/RESET: 16K CK/14 CK + 65 ms
# Brown-out detection level 2.7 V. Serial program downloading enabled
# Boot Reset vector enable (1024 words, 0x3c00). 
lilypad.name=Cosa LilyPad Arduino (ATmega328/BOOT_168, 8 MHz)
lilypad.upload.tool=avrdude
lilypad.upload.protocol=arduino
lilypad.upload.maximum_size=30720
lilypad.upload.maximum_data_size=2048
lilypad.upload.speed=57600

lilypad.bootloader.tool=avrdude
lilypad.bootloader.low_fuses=0xff
lilypad.bootloader.high_fuses=0xda
lilypad.bootloader.extended_fuses=0x05

lilypad.build.mcu=atmega328p
lilypad.build.f_cpu=8000000L
lilypad.build.board=LILYPAD_ARDUINO
lilypad.build.variant=arduino/lilypad
lilypad.build.core=cosa

# AVR:ATmega32U4
# Ext Crystal Osc.>8 MHz; Start-up time PWRDWN/RESET: 16K CK + 65 ms
# Brown-out detection level 2.0 V. Serial program downloading enabled
# Boot Reset vector enable (2048 words, 0x3800). 
lilypad-usb.name=Cosa LilyPad Arduino USB (ATmega32U4/Caterina, 8 MHz)
lilypad-usb.upload.tool=avrdude
lilypad-usb.upload.protocol=avr109
lilypad-usb.upload.maximum_size=28672
lilypad-usb.upload.maximum_data_size=2560
lilypad-usb.upload.speed=57600
lilypad-usb.upload.disable_flushing=true
lilypad-usb.upload.use_1200bps_touch=true
lilypad-usb.upload.wait_for_upload_port=true

lilypad-usb.bootloader.path=caterina
lilypad-usb.bootloader.tool=avrdude
lilypad-usb.bootloader.low_fuses=0xff
lilypad-usb.bootloader.high_fuses=0xd8
lilypad-usb.bootloader.extended_fuses=0xce

lilypad-usb.build.mcu=atmega32u4
lilypad-usb.build.f_cpu=8000000L
lilypad-usb.build.vid=0x1B4F
lilypad-usb.build.pid=0x9208
lilypad-usb.usb_product="Arduino LilyPad USB"
lilypad-usb.build.board=LILYPAD_ARDUINO_USB
lilypad-usb.build.variant=arduino/lilypad-usb
lilypad-usb.build.extra_flags={build.usb_flags}
lilypad-usb.build.core=cosa

##
# LOWPOWERLABS BOARDS
##

# AVR:ATmega328
# Ext Crystal Osc.>8 MHz; Start-up time PWRDWN/RESET: 258 CK/14 CK + 65 ms
# Brown-out detection level 2.7 V. Serial program downloading enabled
# Boot Reset vector enable (512 words, 0x3e00). 
moteino.name=Cosa LowPowerLab Moteino (ATmega328/DualOptiboot)
moteino.upload.tool=avrdude
moteino.upload.protocol=arduino
moteino.upload.maximum_size=31744
moteino.upload.maximum_data_size=2048
moteino.upload.speed=115200

moteino.bootloader.tool=avrdude
moteino.bootloader.low_fuses=0xde
moteino.bootloader.high_fuses=0xdc
moteino.bootloader.extended_fuses=0xfd

moteino.build.mcu=atmega328p
moteino.build.f_cpu=16000000L
moteino.build.board=LOWPOWERLAB_MOTEINO
moteino.build.variant=lowpowerlab/moteino
moteino.build.core=cosa

##
# MICRODUINO CORE MODULES
##

# AVR:ATmega328
# Ext Crystal Osc.>8 MHz; Start-up time PWRDWN/RESET: 16K CK/14 CK + 65 ms
# Brown-out detection level 2.7 V. Serial program downloading enabled
# Boot Reset vector enable (256 words, 0x3f00). 
microduino-core.name=Cosa Microduino-Core (ATmega328/Optiboot)
microduino-core.upload.tool=avrdude
microduino-core.upload.protocol=arduino
microduino-core.upload.maximum_size=32256
microduino-core.upload.maximum_data_size=2048
microduino-core.upload.speed=115200

microduino-core.bootloader.tool=avrdude
microduino-core.bootloader.low_fuses=0xff
microduino-core.bootloader.high_fuses=0xde
microduino-core.bootloader.extended_fuses=0x05

microduino-core.build.mcu=atmega328p
microduino-core.build.f_cpu=16000000L
microduino-core.build.board=MICRODUINO_CORE
microduino-core.build.variant=microduino/core
microduino-core.build.core=cosa

# AVR:ATmega32U4
# Ext Crystal Osc.>8 MHz; Start-up time PWRDWN/RESET: 16K CK + 65 ms
# Brown-out detection level 2.6 V. Serial program downloading enabled
# Boot Reset vector enable (2048 words, 0x3800). 
microduino-core32u4.name=Cosa Microduino-Core32u4 (ATmega32U4/Caterina)
microduino-core32u4.upload.tool=avrdude
microduino-core32u4.upload.protocol=avr109
microduino-core32u4.upload.maximum_size=28672
microduino-core32u4.upload.maximum_data_size=2560
microduino-core32u4.upload.speed=57600
microduino-core32u4.upload.disable_flushing=true
microduino-core32u4.upload.use_1200bps_touch=true
microduino-core32u4.upload.wait_for_upload_port=true

microduino-core32u4.bootloader.path=caterina
microduino-core32u4.bootloader.tool=avrdude
microduino-core32u4.bootloader.low_fuses=0xff
microduino-core32u4.bootloader.high_fuses=0xd8
microduino-core32u4.bootloader.extended_fuses=0xcb

microduino-core32u4.build.mcu=atmega32u4
microduino-core32u4.build.f_cpu=16000000L
microduino-core32u4.build.vid=0x2341
microduino-core32u4.build.pid=0x8036
microduino-core32u4.build.usb_product="Microduino Core32u4"
microduino-core32u4.build.board=MICRODUINO_CORE32U4
microduino-core32u4.build.variant=microduino/core32u4
microduino-core32u4.build.extra_flags={build.usb_flags}
microduino-core32u4.build.core=cosa

# AVR:ATmega644P
# Ext Crystal Osc.>8 MHz; Start-up time PWRDWN/RESET: 16K CK + 65 ms
# Brown-out detection level 2.7 V. Serial program downloading enabled
# Boot Reset vector enable (512 words, 0xfe00). 
microduino-core-plus.name=Cosa Microduino-Core+ (ATmega644P/Optiboot)
microduino-core-plus.upload.tool=avrdude
microduino-core-plus.upload.protocol=arduino
microduino-core-plus.upload.maximum_size=64512
microduino-core-plus.upload.maximum_data_size=4096
microduino-core-plus.upload.speed=115200

microduino-core-plus.bootloader.tool=avrdude
microduino-core-plus.bootloader.low_fuses=0xff
microduino-core-plus.bootloader.high_fuses=0xde
microduino-core-plus.bootloader.extended_fuses=0xfd

microduino-core-plus.build.mcu=atmega644p
microduino-core-plus.build.f_cpu=16000000L
microduino-core-plus.build.board=MICRODUINO_CORE_PLUS
microduino-core-plus.build.variant=microduino/core-plus
microduino-core-plus.build.core=cosa

##
# PINOCCIO BOARDS
##

# AVR:Pinoccio
# Ext Crystal Osc.>8 MHz; Start-up time PWRDWN/RESET: 16K CK + 65 ms
# Brown-out detection level 2.7 V. Serial program downloading enabled
# Boot Reset vector enable (4096 words, 0x1f000). 
pinoccio.name=Cosa Pinoccio Scout (ATmega256RFR2/STK500v2)
pinoccio.upload.tool=avrdude
pinoccio.upload.protocol=wiring
pinoccio.upload.maximum_size=253952
pinoccio.upload.maximum_data_size=32768
pinoccio.upload.speed=115200

pinoccio.bootloader.tool=avrdude
pinoccio.bootloader.low_fuses=0xff
pinoccio.bootloader.high_fuses=0xd0
pinoccio.bootloader.extended_fuses=0xfe

pinoccio.build.mcu=atmega256rfr2
pinoccio.build.f_cpu=16000000L
pinoccio.build.board=PINOCCIO_SCOUT
pinoccio.build.variant=pinoccio/scout
pinoccio.build.core=cosa

