mikaelpatel/Cosa/boards.txt
##
# TEENSY BOARDS
##

# AVR:ATmega32U4
# Ext Crystal Osc.>8 MHz; Start-up time PWRDWN/RESET: 16K CK + 65 ms
# Brown-out detection level 2.6 V. Serial program downloading enabled
# Boot Reset vector enable (2048 words, 0x3800). 
teensy-2_0.name=Cosa Teensy 2.0 (ATmega32U4/halfkay)
teensy-2_0.upload.tool=teensy_reboot
teensy-2_0.upload.protocol=halfkay
teensy-2_0.upload.maximum_size=32256
teensy-2_0.upload.maximum_data_size=2560
teensy-2_0.upload.speed=12000000
teensy-2_0.upload.disable_flushing=true

teensy-2_0.bootloader.path=caterina

teensy-2_0.build.mcu=atmega32u4
teensy-2_0.build.f_cpu=16000000L
teensy-2_0.build.vid=0x16C0
teensy-2_0.build.pid=0x0483
teensy-2_0.build.usb_product="Teensy 2.0"
teensy-2_0.build.board=PJRC_TEENSY_2_0
teensy-2_0.build.variant=pjrc/teensy-2.0
teensy-2_0.build.extra_flags={build.usb_flags}
teensy-2_0.build.core=cosa

# AVR:AT90USB1286
# Ext Crystal Osc.>8 MHz; Start-up time PWRDWN/RESET: 16K CK + 65 ms
# Brown-out detection level 2.6 V. Serial program downloading enabled
# Boot Reset vector enable (2048 words, 0x3800). 
teensypp-2_0.name=Cosa Teensy++ 2.0 (AT90USB1286/halfkay)
teensypp-2_0.upload.tool=teensy_reboot
teensypp-2_0.upload.protocol=halfkay
teensypp-2_0.upload.maximum_size=130048
teensypp-2_0.upload.maximum_data_size=8192
teensypp-2_0.upload.speed=12000000
teensypp-2_0.upload.disable_flushing=true

teensypp-2_0.bootloader.path=caterina

teensypp-2_0.build.mcu=at90usb1286
teensypp-2_0.build.f_cpu=16000000L
teensypp-2_0.build.vid=0x16C0
teensypp-2_0.build.pid=0x0483
teensypp-2_0.build.usb_product="Teensy++ 2.0"
teensypp-2_0.build.board=PJRC_TEENSYPP_2_0
teensypp-2_0.build.variant=pjrc/teensypp-2.0
teensypp-2_0.build.extra_flags={build.usb_flags}
teensypp-2_0.build.core=cosa
